<script>
export default {
    data() {
        return {

        }
    },
    mounted() {

    },
    methods: {
        goToVoinForm() {
            this.$router.push({
                name: 'fe'
            })
        },  
    }
}
</script>

<template>
    <header class="header_container">
        <div class="container_logo_title">
            <p>IMMEPTOR</p>
        </div>
        <div @click="goToVoinForm" class="container_button_login">
            <p>Вернуться</p>
        </div>
    </header>
    <main>
        <h2>Политика конфиденциальности</h2>
        <article class="container_feed">
            <div class="box_information">
                <p>Общие положения</p>
                <div class="element_text">
                    <p>Кочетов Ярослав Олегович (далее – администрация сайта immeptor.ru, Оператор, мы, наш, наши, нас,
                        нам), придаёт большое значение защите Вашей частной жизни и безопасности Ваших персональных данных.
                    </p>
                    <p>Политика предназначена для информирования Вас о наших действиях по сбору, обработке и защите Ваших
                        персональных данных для достижения нами заявленных целей обработки персональных данных на сайте
                        immeptor.ru . </p>
                    <p>Мы соблюдаем требования российского законодательства в области персональных данных. При обработке
                        персональных данных мы придерживаемся принципов, изложенных в ст. 5 Федерального закона от
                        27.07.2006 г №152-ФЗ «О персональных данных» (далее – 152-ФЗ).</p>
                    <p>Просим Вас внимательно изучить Политику конфиденциальности (далее - Политика), чтобы понимать для
                        достижения каких целей мы осуществляем обработку Ваших персональных данных, а также как Вы можете
                        реализовать права, в отношении своих персональных данных, обрабатываемых нами.</p>
                    <p>Если у Вас есть вопросы, связанные с Политикой, в т.ч. предложения по улучшению ее понимания и
                        навигации или есть вопросы по обработке нами Ваших персональных данных и их защите, вы можете
                        направить нам обращение по одному из способов, указанных в разделе «Контакты» .</p>
                </div>
            </div>
            <div class="box_information">
                <p>Термины</p>
                <div class="element_text">
                    <p>Персональные данные – любая информация, относящаяся к прямо или косвенно определенному или
                        определяемому физическому лицу (субъекту персональных данных);</p>
                    <p>Оператор персональных данных (оператор) – государственный орган, муниципальный орган, юридическое или
                        физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие
                        обработку персональных данных, а также определяющие цели обработки персональных данных, состав
                        персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;
                    </p>
                    <div>
                        <p>Обработка персональных данных – любое действие (операция) или совокупность действий (операций) с
                            персональными данными, совершаемых с использованием средств автоматизации или без их
                            использования. Обработка персональных данных включает в себя, в том числе:</p>
                        <ul>
                            <li>сбор</li>
                            <li>запись</li>
                            <li>систематизацию</li>
                            <li>накопление</li>
                            <li>хранение</li>
                            <li>уточнение (обновление, изменение)</li>
                            <li>извлечение</li>
                            <li>использование</li>
                            <li>передачу (распространение, предоставление, доступ)</li>
                            <li>обезличивание</li>
                            <li>блокирование</li>
                            <li>удаление</li>
                            <li>уничтожение</li>
                        </ul>
                    </div>
                    <p>Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств
                        вычислительной техники;</p>
                    <p>Распространение персональных данных – действия, направленные на раскрытие персональных данных
                        неопределенному кругу лиц;</p>
                    <p>Предоставление персональных данных – действия, направленные на раскрытие персональных данных
                        определенному лицу или определенному кругу лиц;</p>
                    <p>Блокирование персональных данных – временное прекращение обработки персональных данных (за
                        исключением случаев, если обработка необходима для уточнения персональных данных);</p>
                    <p>Уничтожение персональных данных – действия, в результате которых становится невозможным восстановить
                        содержание персональных данных в информационной системе персональных данных и (или) в результате
                        которых уничтожаются материальные носители персональных данных;</p>
                    <p>Обезличивание персональных данных – действия, в результате которых становится невозможным без
                        использования дополнительной информации определить принадлежность персональных данных конкретному
                        субъекту персональных данных;</p>
                    <p>Информационная система персональных данных – совокупность содержащихся в базах данных персональных
                        данных и обеспечивающих их обработку информационных технологий и технических средств;</p>
                    <p>Трансграничная передача персональных данных – передача персональных данных на территорию иностранного
                        государства органу власти иностранного государства, иностранному физическому лицу или иностранному
                        юридическому лицу.</p>
                </div>
            </div>
            <div class="box_information">
                <p>1. Сфера применения</p>
                <div class="element_text">
                    <p>Политика предназначена для информирования Вас о наших действиях по сбору, обработке и защите Ваших
                        персональных данных для достижения нами заявленных целей обработки персональных данных на сайте
                        immeptor.ru .</p>
                    <p>Обработки персональных данных, к которым применяется Политика, перечислены в разделе «Для чего мы
                        обрабатываем Ваши персональные данные».</p>
                    <p>Обратите внимание, что наш сайт может содержать ссылки на ресурсы других поставщиков услуг, которые
                        мы не контролируем и на которые не распространяется действие Политики.</p>
                </div>
            </div>
            <div class="box_information">
                <p>2. Сбор персональных данных несовершеннолетних</p>
                <div class="element_text">
                    <p>Несовершеннолетний, используя сайт immeptor.ru, автоматически подтверждает, что получил согласие от
                        своих родителей или законных представителей на обработку персональных данных (в соответствии с
                        частью 1 статьи 64 Семейного кодекса Российской Федерации).</p>
                </div>
            </div>
            <div class="box_information">
                <p>3. Для чего мы обрабатываем Ваши персональные данные</p>
                <div class="element_text">
                    <p>На сайте осуществляется обработка Ваших персональных данных для достижения целей, описанных ниже.
                        Просим Вас считать текст в каждом блоке с нумерацией «3.1.1. Название» считать текстом согласия на
                        обработку персональных данных, информация об отзыве которого описана в п.4.9 и 4.10.</p>
                </div>
            </div>
            <div class="box_information">
                <p>4. Каковы Ваши права?</p>
                <div class="box_child_information">
                    <p>4.1. Общая информация о Ваших правах</p>
                    <div class="element_text">
                        <div>
                            <p>В соответствии с 152-ФЗ, Вы имеете следующие права при обработке персональных данных:</p>
                            <ul>
                                <li>право на доступ к персональным данным;</li>
                                <li>право на уточнение персональных данных;</li>
                                <li>право на обжалование наших действий или нашего бездействия;</li>
                                <li>право на обжалование решений, принятых на основании исключительно автоматизированной
                                    обработки их персональных данных;</li>
                                <li>право на отзыв согласия.</li>
                            </ul>
                        </div>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.2. Запрос дополнительной информации для идентификации субъекта персональных данных</p>
                    <div class="element_text">
                        <p>В ходе реализации Ваших прав мы можем запрашивать дополнительную информацию, которая позволит нам
                            достоверно идентифицировать Вас. Такая информация будет требоваться в редких случаях.</p>
                        <p>Мы стараемся запрашивать минимально необходимый состав дополнительной информации для Вашей
                            идентификации.</p>
                        <p>Мы не сможем реализовать Ваши права, если в ответ на наш запрос вы не предоставите дополнительную
                            информацию для Вашей идентификации.</p>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.3. Условия предоставления информации по Вашим правам</p>
                    <div class="element_text">
                        <p>Информация, связанная с реализацией Ваших прав, предоставляется бесплатно. Если Ваш запрос
                            является явно необоснованным или чрезмерным, в частности из-за его повторяющегося характера, мы
                            можем отказаться от ответа, либо взимать плату за предоставление запрашиваемой информации.</p>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.4. Право на доступ к Вашим персональным данным</p>
                    <div class="element_text">
                        <div>
                            <p>Вы имеете право получить от нас достоверную информацию об обработке Ваших персональных
                                данных, и, если это возможно, доступ к персональным данным и к следующей информации:</p>
                            <ul>
                                <li>подтверждение факта обработки персональных данных оператором;</li>
                                <li>правовые основания и цели обработки персональных данных;</li>
                                <li>цели и применяемые оператором способы обработки персональных данных;</li>
                                <li>наименование и место нахождения оператора, сведения о лицах (за исключением работников
                                    оператора), которые имеют доступ к персональным данным или которым могут быть раскрыты
                                    персональные данные на основании договора с оператором или на основании федерального
                                    закона;</li>
                                <li>обрабатываемые персональные данные, относящиеся к Вам, источник их получения;</li>
                                <li>сроки обработки персональных данных, в том числе сроки их хранения;</li>
                                <li>порядок осуществления Вами своих прав согласно 152-ФЗ;</li>
                                <li>информацию об осуществленной или о предполагаемой трансграничной передаче данных;</li>
                                <li>наименование или фамилию, имя, отчество и адрес лица, осуществляющего обработку
                                    персональных данных по поручению оператора, если обработка поручена или будет поручена
                                    такому лицу</li>
                            </ul>
                        </div>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.5. Право на уточнение Ваших персональных данных</p>
                    <div class="element_text">
                        <p>Мы принимаем усилия, направленные на то, чтобы выявлять неточные, неполные или устаревшие данные.
                        </p>
                        <p>Если данные являются неточными, неполными или устаревшими, вы имеете право потребовать от нас
                            исправления данных, касающихся Вас, без лишнего промедления.</p>
                        <p>После исправления Ваших персональных данных мы уведомим Вас об этом.</p>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.6. Право на обжалование наших действий или нашего бездействия</p>
                    <div class="element_text">
                        <p>Вы имеете право возражать против обработки своих персональных данных в ответ на наши действия или
                            наше бездействия.</p>
                        <p>Для этого вы можете обратиться в территориальный орган Роскомнадзора в своем регионе.</p>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.7. Право на обжалование решений, принятых на основании исключительно автоматизированной обработки
                        персональных данных</p>
                    <div class="element_text">
                        <p>Вы имеете право не подвергаться решению, основанному исключительно на автоматизированной
                            обработке, включая профилирование, которое влечет за собой юридические последствия в отношении
                            Вас или аналогичным образом существенно влияет на Вас.</p>
                        <p>Вы вправе обратиться к нам для обжалования наших действий при принятии нами решений на основании
                            исключительно автоматизированной обработки их персональных данных, если такие имеются.</p>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.8. Право на отзыв согласия</p>
                    <div class="element_text">
                        <p>Если Ваши данные обрабатываются на основании согласия, то вы имеете право отозвать его.</p>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.9. Как Вы можете реализовать свои права?</p>
                    <div class="element_text">
                        <p>Для реализации Ваших прав нами Вы должны обратиться к нам напрямую по электронной почте
                            immeptor@xmail.ru .</p>
                    </div>
                </div>
                <div class="box_child_information">
                    <p>4.10. Как и когда мы не можем реализовать Ваши права</p>
                    <div class="element_text">
                        <div>
                            <p>Мы можем ограничить объем наших обязательств и Ваших прав (на доступ к данным, их уточнение,
                                блокирование или удаление), в следующих случаях:</p>
                            <ul>
                                <li>обработка персональных данных, включая персональные данные, полученные в результате
                                    оперативно-розыскной, контрразведывательной и разведывательной деятельности,
                                    осуществляется в целях обороны страны, безопасности государства и охраны правопорядка;
                                </li>
                                <li>обработка персональных данных осуществляется органами, осуществившими задержание
                                    субъекта персональных данных по подозрению в совершении преступления, либо предъявившими
                                    субъекту персональных данных обвинение по уголовному делу, либо применившими к субъекту
                                    персональных данных меру пресечения до предъявления обвинения, за исключением
                                    предусмотренных уголовно-процессуальным законодательством Российской Федерации случаев,
                                    если допускается ознакомление подозреваемого или обвиняемого с такими персональными
                                    данными;</li>
                                <li>обработка персональных данных осуществляется в соответствии с законодательством о
                                    противодействии легализации (отмыванию) доходов, полученных преступным путем, и
                                    финансированию терроризма;</li>
                                <li>доступ субъекта персональных данных к его персональным данным нарушает права и законные
                                    интересы третьих лиц;</li>
                                <li>обработка персональных данных осуществляется в случаях, предусмотренных
                                    законодательством Российской Федерации о транспортной безопасности, в целях обеспечения
                                    устойчивого и безопасного функционирования транспортного комплекса, защиты интересов
                                    личности, общества и государства в сфере транспортного комплекса от актов незаконного
                                    вмешательства.</li>
                                <li>когда мы имеем законные основания для продолжения обработки Ваших персональных данных.
                                </li>
                            </ul>
                        </div>
                        <p>Для реализации некоторых прав существуют особые условия, без выполнения которых право не может
                            быть реализовано.</p>
                        <p>Если мы не можем реализовать Ваше право по Вашему запросу, то мы пишем Вам мотивированный отказ.
                        </p>
                    </div>
                </div>
            </div>
            <div class="box_information">
                <p>5. Cookie и автоматическое логирование</p>
                <div class="element_text">
                    <p>Файлы cookie являются одной из технологий, которые мы используем для автоматического сбора информации
                        и улучшения качества контента. Файл cookie - это небольшой текстовый файл, который хранится на
                        устройстве (компьютере, планшете, смартфоне и т.д.) и содержит информацию о Вашей активности в
                        Интернете.</p>
                    <p>Также, как и большинство других информационных ресурсов организаций, наши веб-серверы и системы
                        безопасности время от времени хранят некоторые временные технические данные в своих лог-файлах.</p>
                    <div class="table_privacy">
                        <div>
                            <p>Собираемые cookie на нашем сайте:</p>
                        </div>
                        <table>
                            <colgroup>
                                <!-- <col span="2" style="background:Khaki"> -->
                                <!-- С помощью этой конструкции задаем цвет фона для первых двух столбцов таблицы-->
                                <!-- <col style="background-color:LightCyan"> -->
                                <!-- Задаем цвет фона для следующего (одного) столбца таблицы-->
                            </colgroup>
                            <tr>
                                <th>Название</th>
                                <th>Поставщик</th>
                                <th>Время жизни</th>
                            </tr>
                            <tr>
                                <td>cookieName</td>
                                <td>immeptor.ru</td>
                                <td>7 дней</td>
                            </tr>
                        </table>
                    </div>
                </div>
            </div>
            <div class="box_information">
                <p>6. Безопасность данных</p>
                <div class="element_text">
                    <p>Персональные данные, которые мы собираем и храним, считаются конфиденциальной информацией. Они защищены от потери, изменения или несанкционированного доступа согласно законодательству Российской Федерации в области персональных данных. Для этого мы применяем технические средства и организационные меры. Мы постоянно совершенствуем наши системы защиты данных.</p>
                </div>
            </div>
            <div class="box_information">
                <p>7. Изменение политики</p>
                <div class="element_text">
                   <p>Мы оставляем за собой право вносить изменения в нашу Политику в любое время. Мы просим Вас регулярно просматривать все обновления нашей Политики. Мы будем направлять уведомления об изменениях Политики в случае, если такие изменения являются существенными, всеми доступными нам способами.</p>
                </div>
            </div>
            <div class="box_information">
                <p>8. Контакты</p>
                <div class="element_text">
                   <p>Обращаем Ваше внимание, что указанные в данном пункте контакты используются только для взаимодействия по вопросам обработки и защиты Ваших персональных данных. Обращения, направленные Вами по указанным в Политике контактам, не связанные с защитой данных, не будут рассмотрены. Для вопросов, связанных с обработкой и защитой персональных данных, вы можете обратиться по электронной почте: immeptor@xmail.ru.</p>
                </div>
            </div>
            <div class="last_update">
                <p>Последнее обновление: 02.12.2023</p>
            </div>
        </article>
    </main>
</template>

<style scoped>
@import url('https://fonts.googleapis.com/css2?family=Hedvig+Letters+Sans&display=swap');

* {
    margin: 0;
    font-family: 'Hedvig Letters Sans', sans-serif;
}

main {
    display: flex;
    flex-direction: column;
    width: 100%;
    min-height: 100%;
    align-items: center;
}

.header_container {
    background-color: black;
    width: 100%;
    height: 55px;
    display: flex;
    justify-content: space-around;
}

.container_logo_title {
    height: 100%;
    width: auto;
    display: flex;
    justify-content: center;
    align-items: center;
}

.container_logo_title p {
    color: #FFF;
    font-family: 'Inter', sans-serif;
    font-size: 24px;
    font-style: normal;
    font-weight: 400;
    line-height: normal;
}

.container_button_login {
    display: flex;
    align-items: center;
    width: auto;
    height: 100%;
}

.container_button_login p {
    background-color: white;
    color: #707070;
    font-family: 'Inter', sans-serif;
    font-size: 15px;
    font-style: normal;
    font-weight: 400;
    line-height: normal;
    padding: 5px 30px;
    border-radius: 7px;
    transition: all 0.1s;
}

.container_button_login p:hover {
    background-color: rgb(233, 233, 233);
    cursor: pointer;
    color: #000;
}

.container_feed {
    padding-top: 20px;
    width: 60%;
    display: flex;
    align-items: center;
    flex-direction: column;
    height: auto;
    gap: 30px;
}

h2 {
    font-size: 30px;
    padding: 20px 0;
}

span {
    background: yellow;
}

.box_information {
    display: flex;
    flex-direction: column;
    align-items: start;
    width: 100%;
    font-size: 21px;
    font-style: italic;
    font-weight: 550;
    gap: 5px;
}

.box_information p {
    padding-bottom: 10px;
}

.element_text {
    display: flex;
    align-items: start;
    flex-direction: column;
    font-size: 16px;
    font-weight: 400;
    font-style: normal;
    gap: 10px;
    width: 100%;
}

.box_child_information {
    font-size: 17px;
    padding-bottom: 10px;
}

.box_child_information .element_text {
    position: relative;
    left: 40px;
}

ul {
    padding-bottom: 15px;
    display: flex;
    flex-direction: column;
    gap: 7px;
    font-size: 15px;
}
table {
    width: 60%;
    border: 1px solid grey;
    /* position: relative;
    left: 2px;
    right: 2px; */
}
/* границы ячеек первого ряда таблицы */
th {
    width: 20%;
   border: 1px solid grey;
}
/* границы ячеек тела таблицы */
td {
    width: 20%;
   border: 1px solid grey;
   text-align: center;
}

.table_privacy {
    width: 100%;
    display: flex;
    flex-direction: column;
    align-items: center;
}

.table_privacy div {
    width: 100%;
    display: flex;
    justify-content: start;
}

.last_update {
    padding-bottom: 20px;
}
</style>